// Написать программу вычисления поизведения чисел от 1 до N

int i=1;
int a=5;
int k=1;
while (i<=a)
{
    k=k*i;
    i++;
}
 System.Console.Write($"{k}");   