// Написать программу вычисления значения функции y=sin(a)

/*double x,y;
x=3.14;
y=Math.Sin(x);
Console.WriteLine($"sin({x})={y}");*/

double Sin(double x)
{
    return Math.Sin(x);
}

double y=Sin(3.14);
Console.WriteLine(y);
