// Вывести на экран числа от -N до N


int i=-50;
int N=50;
while(i<=N)
{
    System.Console.Write($"{i} ");
    i=i+1;
}