// Вывести на экран кубы чисел от 1 до N

int i=1;
int N=30;
int k;
while(i<N)
{
    k=i*i*i;
    System.Console.Write($"{k} ");
    i++;
}

