// Вывести на экран последнюю цифру целого числа введенного с клавиатуры 

int a=156123;
int b=a%10;
Console.WriteLine(b);